# IFC_ClearPset

## Description
Removes a property set from the object

```pascal
FUNCTION IFC_ClearPset(
				hObject       : HANDLE;
				inStrPsetName : STRING) : BOOLEAN;
```

```python

def vs.IFC_ClearPset(hObject, inStrPsetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrPsetName|STRING||

## Version
Availability: from Vectorworks 2016
## Category
* IFC